/******************************************************************************
*  ASR => M2101                                                               *
*******************************************************************************
*                                                                             *
*  N° de Sujet :  2                                                           *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Intitulé : Analyse d’adresses IP                                           *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom-prénom1 : Rousseau Nicolas                                             *
*                                                                             *
*  Nom-prénom2 : Philémon Hinfray--Cacheux                                    *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom du fichier :    ip.h                                                  *
*                                                                             *
******************************************************************************/

//Procédure de détermination de la classe
void classe(int ip1);

//Procédure de détermination du type de l'ip
void type(int ip1, int ip2, int ip3, int ip4, int host2, int host3, int host4);